Revit 2024 API
ViewDisplayBackground.ImageFlags Property
 The image alignment indicators when the type is 'Image'.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ViewDisplayBackgroundImageFlags ImageFlags { get; }
Visual Basic
Public ReadOnly Property ImageFlags As ViewDisplayBackgroundImageFlags
	Get
Visual C++
public:
property ViewDisplayBackgroundImageFlags ImageFlags {
	ViewDisplayBackgroundImageFlags get ();
}
See Also
ViewDisplayBackground Class
Autodesk.Revit.DB Namespace